# http://sourabhbajaj.com/mac-setup/
# https://github.com/Homebrew/homebrew-bundle

brew "azure-cli"
brew "faas-cli"
brew "go"
brew "htop"
brew "hh"
brew "fd"
brew "glances"
brew "git"
brew "git-lfs"
brew "diff-so-fancy"
brew "certbot"
brew "httpie"
brew "jq"
brew "kubernetes-cli"
brew "gnupg"
brew "hopenpgp-tools"
brew "node"
brew "pinentry"
brew "pinentry-mac"
brew "python"
brew "sqlite"
brew "subversion"
brew "telnet"
brew "tree"
brew "watch"
brew "yarn"
brew "youtube-dl"
brew "xz"
brew "wget"
brew "upx"
brew "travis"
brew "tmux"
brew "the_silver_searcher"
brew "terraform"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pstree"
brew "prettyping"
brew "namebench"
brew "ncdu"
brew "neovim"
brew "kubernetes-helm"
brew "jsonlint"
brew "zsh"
brew "maven"

tap "knqyf263/pet"
brew "pet"
tap "garethr/kubeval"
brew "kubeval"
tap "johanhaleby/kubetail"
brew "kubetail"
brew "kafkacat"

cask "font-fira-code"
cask "virtualbox"
cask "vagrant"
cask "alfred"
cask "dash"
cask "docker"
cask "iterm2"

tap "caskroom/versions"
cask "java8"
